-------------------------------------------------------------------
-- 版  权:	(C) 深圳冰川网络技术有限公司 2008 - All Rights Reserved
-- 创建人:	彭政林
-- 日  期:	11/25/2016
-- 版  本:	1.0
-- 描  述:	场景ID
-------------------------------------------------------------------

-------------------------------------------------------------------
-- 一个场景一个lua vm 需要记录是属于哪个场景ID,需要对应操作
-------------------------------------------------------------------
-- 场景ID
g_nLuaSceneID = 0

-------------------------------------------------------------------
-- 设置LUA场景ID
-------------------------------------------------------------------
function SetLuaSceneID(nLuaSceneID)
	error("nLuaSceneID="..nLuaSceneID)
	g_nLuaSceneID = nLuaSceneID

	--print(package.path)
end

-------------------------------------------------------------------
-- 获取LUA场景ID
-------------------------------------------------------------------
function GetLuaSceneID()
	return g_nLuaSceneID
end


-------------------------------------------------------------------
-- 销毁Scene时被调用
-- param: nSceneID: 场景ID
-------------------------------------------------------------------
function Scene_unload(nSecenID)
	error("Scene_unload: nSecenID="..nSecenID)
	-- 发场景销毁事件
	g_luaEventPublisher:FireEvent(LUA_EVENT_SCENE_UNLOAD, nSecenID)
end