/*******************************************************************
** 文件名: CWarBase.h
** 版  权: (C) 深圳冰川网络技术有限公司(www.weimingtech.com)
** 创建人: 李有红
** 日  期: 2017/11/5
** 版  本: 1.0
** 描  述: 战场子功能接口
** 应  用: 
**************************** 修改记录 ******************************
** 修改人:  
** 日  期: 
** 描  述:  
********************************************************************/
#pragma once

class __IWarMgr
{
public:
	// 初始化
	virtual bool Init(int nMatchType) = 0;

	// 释放
	virtual void Release() = 0;

	// 战场正式开始
	virtual void onWarRealStart() = 0;

	// 战场结束
	virtual void onWarEnd() = 0;
};