/*******************************************************************
** 文件名:	d:\Rocket20100701\Common\MiscDef.h
** 版  权:	(C) 深圳冰川网络技术有限公司
** 创建人:	彭智锋 （9671690@qq.com）
** 日  期:	2011/4/26 10:57
** 版  本:	1.0
** 描  述:	反黑
** 应  用:  	
	
**************************** 修改记录 ******************************
** 修改人: 
** 日  期: 
** 描  述: 
********************************************************************/
#pragma once

#pragma pack(1)

// tolua_begin

// 反黑类型
enum
{
	ANTIHACKER_TYPE_RECORDDEBUG,			// 记录调试信息
};

struct SAntiHackerMsg_RecordDebug
{
	DWORD dwPDBID;

};
// tolua_end

#pragma pack()