/*******************************************************************
** 文件名:	CampDef.h
** 版  权:	(C) 深圳冰川网络技术有限公司 2008 - All Rights Reserved
** 创建人:	李界华
** 日  期:	2015-11-3
** 版  本:	1.0
** 描  述:	阵营相关定义

			
********************************************************************/

#pragma once


#include "ManagedCode.h"


//////////////////////////////////////////////////////////////////////////
/*						C++和C#公用数据结构								*/
//////////////////////////////////////////////////////////////////////////
// 阵营类型
ENUM CAMP_TYPE
{
	CAMP_INVALID	=	-1,
	// 中立阵营
	CAMP_NEUTRAL	=	0,
	// 蓝方
	CAMP_BLUE		=	1,
	// 红方
	CAMP_RED		=	2,

	CAMP_MAX
};

// 新玩家最大阵营数
#define DOTA2_CAMP_MAX_NUM			32