/*******************************************************************
** 文件名:	IByteRecord.h
** 版  权:	(C) 深圳冰川网络股份有限公司
** 创建人:	baoliang.shen
** 日  期:	2017/11/28
** 版  本:	1.0
** 描  述:	流量记录接口
** 应  用:  	
**************************** 修改记录 ******************************
** 修改人: 
** 日  期: 
** 描  述: 
********************************************************************/
#pragma once

class IByteRecord
{
public:
	// 收到数据时调用
	virtual void OnRecvData(DWORD dwDataLen) = 0;
	// 发送数据时调用
	virtual void OnSendData(DWORD dwDataLen) = 0;

};