-------------------------------------------------------------------
-- 版  权:	(C) 深圳冰川网络技术有限公司 2008 - All Rights Reserved
-- 创建人:	易耀辉
-- 日  期:	3/31/2017
-- 版  本:	1.0
-- 描  述:	镶嵌宝石
-------------------------------------------------------------------

require "TaskFrameActorData"

-------------------------------------------------------------------
-- 镶嵌宝石
-------------------------------------------------------------------
Task_12_InlayGem = TaskFrameActorData:new
{
	tFinishCondition = { ConditionInlayCrownGem:new{count=1} },			 -- 完成条件
}