-------------------------------------------------------------------
-- 版  权:	(C) 深圳冰川网络技术有限公司 2008 - All Rights Reserved
-- 创建人:	易耀辉
-- 日  期:	3/31/2017
-- 版  本:	1.0
-- 描  述:	使用xp
-------------------------------------------------------------------

require "TaskFramePlayDotaGame"

-------------------------------------------------------------------
-- 使用xp
-------------------------------------------------------------------
Task_14_UseXP = TaskFramePlayDotaGame:new
{
	tFinishCondition = { ConditionUseXp:new{} },			 -- 完成条件
}