-------------------------------------------------------------------
-- 版  权:	(C) 深圳冰川网络技术有限公司 2008 - All Rights Reserved
-- 创建人:	易耀辉
-- 日  期:	3/31/2017
-- 版  本:	1.0
-- 描  述:	建立师徒关系
-------------------------------------------------------------------

require "TaskFrameActorData"

-------------------------------------------------------------------
-- 建立师徒关系
-------------------------------------------------------------------
Task_31_BuildMentorship = TaskFrameActorData:new
{
	tFinishCondition = { ConditionMentorshipCount:new{count=1} },			 -- 完成条件
}