-------------------------------------------------------------------
-- 版  权:	(C) 深圳冰川网络技术有限公司 2008 - All Rights Reserved
-- 创建人:	易耀辉
-- 日  期:	3/31/2017
-- 版  本:	1.0
-- 描  述:	英雄晋级
-------------------------------------------------------------------

require "TaskFrameActorData"

-------------------------------------------------------------------
-- 英雄晋级
-------------------------------------------------------------------
Task_13_UpGradeHero = TaskFrameActorData:new
{
	tFinishCondition = { ConditionHeroUpGrade:new{level=2} },			 -- 完成条件
}