-------------------------------------------------------------------
-- 版  权:	(C) 深圳冰川网络技术有限公司 2008 - All Rights Reserved
-- 创建人:	周坤
-- 日  期:	8/4/2017
-- 版  本:	1.0
-- 描  述:	求师傅啊
-------------------------------------------------------------------

require "TaskFrameActorData"

-------------------------------------------------------------------
-- 求师傅啊
-------------------------------------------------------------------
Task_308_ApplyMaster = TaskFrameActorData:new
{
	tFinishCondition = { ConditionCheckIsMaster:new{} },			 -- 完成条件
}
