/*******************************************************************
** 文件名:	IDiePart.h
** 版  权:	(C) 深圳冰川网络技术有限公司 2008 - All Rights Reserved
** 创建人:	李界华
** 日  期:	1/8/2015
** 版  本:	1.0
** 描  述:	实体死亡部件接口

********************************************************************/

#pragma once

#include "IEntity.h"

// 实体死亡部件接口
struct IDiePart : public IEntityPart
{
    // 是否隐藏尸体
    virtual bool isHideBody() = 0;
};


///////////////////////////////////////////////////////////////////////////////////////////////////////
//extern "C" IDiePart * createDiePart();