/*******************************************************************
** 文件名:	ITitlePart.h 
** 版  权:	(C) 深圳冰川网络技术有限公司 2008 - All Rights Reserved
** 创建人:	李界华
** 日  期:	2016-6-27
** 版  本:	1.0
** 描  述:	实体称号部件接口

********************************************************************/

#pragma once

#include "IEntity.h"
#include "TitleDef.h"


// 实体称号部件接口
struct ITitlePart : public IEntityPart
{

};





///////////////////////////////////////////////////////////////////////////////////////////////////////
//extern "C" ITitlePart * createTitlePart();